[
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 2(h)",
    "text": "\"harassment\" means: (i) any unwelcome sexual advance, request for sexual favours, stalking or cyber stalking or other verbal, visual or written communication or physical conduct of a sexual nature or sexually demeaning attitudes, including any gestures or expression conveying derogatory connotation causing interference with work performance or creating an intimidating, hostile or offensive work environment, or the attempt to punish the complainant for refusal to comply to such a request or is made a condition for employment; or (ii) discrimination on basis of gender, which may or may not be sexual in nature, but which may embody a discriminatory and prejudicial mind set or notion, resulting in discriminatory behavior on basis of gender against the complainant",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "harassment",
      "workplace",
      "gender",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 2(e)",
    "text": "\"complainant\" means any person who has made a complaint to the Ombudsperson or to the Inquiry Committee on being aggrieved by an act of harassment and shall include a former employee who has been removed or dismissed from service or has resigned, and a parent or guardian where the complainant is a minor",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "complainant",
      "harassment",
      "minor",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 3",
    "text": "Each organization shall constitute an Inquiry Committee within thirty days of the enactment of this Act to enquire into complaints under this Act. The Committee shall consist of three members of whom at least one member shall be a woman. One member shall be from senior management and one shall be a senior representative of the employees or a senior employee where there is no CBA.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "inquiry",
      "committee",
      "women representation",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 4(4)",
    "text": "If the Inquiry Committee finds the accused to be guilty it shall recommend to the Competent Authority for imposing one or more of the following penalties: Minor penalties: censure, withholding promotion or increment, recovery of compensation; Major penalties: reduction to lower post, compulsory retirement, removal from service, dismissal from service, suspension or cancellation of professional license, and Fine.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "penalties",
      "harassment",
      "disciplinary action",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 4(7)",
    "text": "In case the complainant is in trauma the organization will arrange for psycho-social counseling or medical treatment and for additional medical leave.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "trauma",
      "support",
      "counseling",
      "victim care"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 7",
    "text": "The respective Governments shall appoint an Ombudsperson at the Federal and Provincial levels. A person shall be qualified to be appointed as an Ombudsperson who has been a judge of High Court or qualified to be appointed as a judge of High Court.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "ombudsperson",
      "judiciary",
      "appointment",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Section 11",
    "text": "It shall be the responsibility of the employer to ensure implementation of this Act, including but not limited to incorporate the Code of Conduct for protection against harassment at the workplace as a part of their management policy and to form Inquiry Committee and designate a Competent Authority.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "employer responsibility",
      "policy",
      "implementation",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Schedule - Code of Conduct (Abuse of Authority)",
    "text": "A demand by a person in authority, such as a supervisor, for sexual favors in order for the complainant to keep or obtain certain job benefits, be it a wage increase, a promotion, training opportunity, a transfer or the job itself.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "abuse of authority",
      "sexual favors",
      "job benefits",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Schedule - Code of Conduct (Hostile Environment)",
    "text": "Any unwelcome sexual advance, request for sexual favors, or other verbal or physical conduct of a sexual nature, which interferes with an individual's work performance or creates an intimidating, hostile, abusive or offensive work environment; or any discrimination on basis of gender. A single incident having the effect of making a person uncomfortable or creating a sense of fear or panic at the workplace is also harassment.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "hostile environment",
      "sexual harassment",
      "workplace",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "Schedule - Code of Conduct (Retaliation)",
    "text": "The refusal to grant a sexual favor can result in retaliation, which may include limiting the employee's options for future promotions or training, distorting the evaluation reports, generating gossip against the employee or other ways of limiting access to his/her rights. Filing counter-blast suits for defamation etc. are also retaliation.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "retaliation",
      "sexual harassment",
      "promotion limitation",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 5 - Registration of Marriage",
    "text": "Every marriage solemnized under Muslim Law shall be registered in accordance with the provisions of this Ordinance. For the purpose of registration of marriage under this Ordinance, the Union Council shall grant licenses to one or more persons, to be called Nikah Registrars.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "marriage registration",
      "nikah registrar",
      "union council",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "6",
    "text": "No man, during the subsistence of an existing marriage, shall except with the previous permission in writing of the Arbitration Council, contract another marriage, nor shall any such marriage contracted without such permission be registered under this Ordinance",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "6(3)",
    "text": "The Arbitration Council so constituted may, if satisfied that the proposed marriage is necessary and just, grant, subject to such condition if any, as may be deemed fit, the permission applied for",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "6(5)",
    "text": "Any man who contracts another marriage without the permission of the Arbitration Council shall: (a) pay immediately the entire amount of the dower whether prompt or deferred, due to the existing wife or wives, which amount, if not so paid, shall be recoverable as arrears of land revenue; and (b) on conviction upon complaint be punishable with simple imprisonment which may extend to one year, or with fine which may extend to five thousand rupees, or with both",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "7",
    "text": "Any man who wishes to divorce his wife shall, as soon as may be after the pronouncement of talaq in any form whatsoever, give the chairman a notice in writing of his having done so, and shall supply a copy thereof to the wife",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "7(3)",
    "text": "Save as provided in sub-section (5) talaq, unless revoked earlier, expressly or otherwise, shall not be effective until the expiration of ninety days from day on which notice under sub-section (1) is delivered to the Chairman",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "7(4)",
    "text": "Within thirty days of the receipt of notice under Sub-section (1), the Chairman shall constitute an Arbitration Council for the purpose of bringing about a reconciliation between the parties, and the Arbitration Council shall take all steps necessary to bring about such reconciliation",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "7(5)",
    "text": "If the wife be pregnant at the time talaq is pronounced, talaq shall not be effective until the period mentioned in Sub-section (3) or the pregnancy, whichever later, ends",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "8",
    "text": "Where the right to divorce has been duly delegated to the wife and she wishes to exercise that right, or where any of the parties to a marriage wishes to dissolves the marriage otherwise than by talaq the provisions of section 7 shall, mutatis mutandis and so far as applicable, apply",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "9",
    "text": "If any husband fails to maintain his wife adequately, or where there are more wives than one, fails to maintain them equitably, the wife, or all or any of the wives, may in addition to seeking any other legal remedy available apply to the Chairman who shall constitute an Arbitration Council to determine the matter",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "10",
    "text": "Where no details about the mode of payment of dower are specified in the nikahnama or the marriage contract, the entire amount of the dower shall be presumed to be payable on demand",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "4",
    "text": "In the event of death of any son or daughter of the propositus before the opening of succession, the children of such son or daughter, if any, living at the time the succession opens, shall per stripes, receive a share equivalent to the share which such son or daughter, as the case may be, would have received if alive",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(f)",
    "text": "\"employee\" includes a regular, contractual, piece-rate, gig, temporary, part-time, freelance employee whether employed through express or implied contract on daily, weekly, monthly or hourly basis, and shall include a student, a performer, an artist, a sportsperson, an intern, trainee, a domestic worker, a home-based worker or an apprentice whether working for remuneration or not, or whether working on a voluntary basis or otherwise",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(n)",
    "text": "\"workplace\" means the place of work or any place where services are rendered or performed by professionals, including educational institutions, gigs, concerts, studios, performance facilities, courts, highways, sporting facilities and gymnasiums, and shall include any situation that is linked to work or activity outside the office",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(g)",
    "text": "\"employer\" includes person who owns or manages an online or customer to customer or business to customer or any other virtual or remote business; and in relation to a dwelling place or house, a person or a household who employs or benefits from the employment of home-based workers, irrespective of the number, time period or type of such worker employed",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "1",
    "text": "This Act may be cited as the Punjab Protection of Women against Violence Act 2016. It extends to the whole of the Punjab. It shall come into force on such date as the Government may, by notification, specify and different dates may be so specified for various areas in the Punjab.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(a)",
    "text": "\"aggrieved person\" means a female who has been subjected to violence by a defendant",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(h)",
    "text": "\"domestic violence\" means the violence committed by the defendant with whom the aggrieved is living or has lived in a house when they are related to each other by consanguinity, marriage or adoption",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(j)",
    "text": "\"house\" includes a place where the aggrieved person lives in a domestic relationship irrespective of right to ownership or possession of the aggrieved person, defendant or joint family",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(r)",
    "text": "\"violence\" means any offence committed against the human body of the aggrieved person including abetment of an offence, domestic violence, sexual violence, psychological abuse, economic abuse, stalking or a cybercrime",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(r)(1)",
    "text": "\"economic abuse\" means denial of food, clothing and shelter in a domestic relationship to the aggrieved person by the defendant in accordance with the defendant's income or taking away the income of the aggrieved person without her consent by the defendant",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "2(r)(2)",
    "text": "\"psychological violence includes psychological deterioration of aggrieved person which may result in anorexia, suicide attempt or clinically proven depression resulting from defendant's oppressive behavior or limiting freedom of movement of the aggrieved person and that condition is certified by a panel of psychologists appointed by District Women Protection Committee",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "3",
    "text": "The Government shall institute a universal toll free dial-in-number for the aggrieved persons, establish Protection centers and shelter homes under a phased programme, appoint necessary staff at a Protection Centre for mediation and reconciliation between the parties, rescue, medical examination, medical and psychological treatment and legal help",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "4",
    "text": "An aggrieved person, or a person authorized by the aggrieved person or the Women Protection Officer may submit a complaint for obtaining a protection, residence or monetary order in favour of the aggrieved person in the Court. The Court shall fix the first date of hearing which shall not be beyond seven days from the date of the receipt of the complaint",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "5",
    "text": "The aggrieved person, who is the victim of domestic violence shall not be evicted, save in accordance with law, from the house without her consent or if wrongfully evicted, the Court shall restore the position maintaining before the eviction of the aggrieved person if the aggrieved person has right, title or beneficial interest in the house",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "6",
    "text": "Pending proceedings under this Act, the Court may, at any stage of the complaint, pass such interim order as it deems just and proper. If the Court is satisfied that the complaint prima facie shows that the defendant has committed an act of violence or is likely to commit an act of violence, it may issue an order on the basis of an affidavit",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "7",
    "text": "If the Court is satisfied that any violence has been committed or is likely to be committed, the Court may pass a protection order in favour of the aggrieved person and direct the defendant not to have any communication with the aggrieved person, stay away from the aggrieved person, wear ankle or wrist bracelet GPS tracker for any act of grave violence",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "8",
    "text": "The Court, in case of domestic violence, may pass a residence order directing that the aggrieved person shall not be evicted from the house, has the right to stay in the house, may be relocated to the shelter home for purposes of relief, protection and rehabilitation",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "9",
    "text": "The Court may pass an order directing the defendant to pay monetary relief to meet the expenses incurred and losses suffered by the aggrieved person including compensation for economic abuse, loss of earning, medical expense, loss caused due to destruction of property, and reasonable maintenance",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "11",
    "text": "The Government shall constitute a District Women Protection Committee for each district headed by the District Coordination Officer and consisting of Executive District Officer (Health), Executive District Officer (Community Development), representative of District Police, District Officer Social Welfare, District Public Prosecutor, and District Women Protection Officer",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "12",
    "text": "The Committee shall supervise the working of the Protection Centre, shelter home and toll free helpline, ensure uninterrupted functioning of toll free dial-in-number, develop liaison with other departments, try mediation and reconciliation between parties, ensure cases of violence are referred to Protection Centre for medical examination and investigation",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "13",
    "text": "The Government shall establish Protection Centres as converging point for all essential services including police reporting, registration of criminal cases, medical examination, collection of forensic evidence, first aid relief, immediate protection, legal aid, psychological counseling, and mediation",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "14",
    "text": "The Government shall appoint a District Women Protection Officer for a district and Women Protection Officers who shall supervise and coordinate the protection system, maintain liaison, provide counselling services, approve rescue operations, file habeas corpus cases, and set specific targets for the protection system",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "15",
    "text": "The District Women Protection Officer or a Women Protection Officer may at any time enter in any place or house for the purpose of rescuing an aggrieved person but shall not rescue without her consent. The powers of entry in a house shall only be exercised by a female officer",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "18",
    "text": "Any person who obstructs the District Woman Protection Officer or a Woman Protection Officer in the performance of duties shall be liable to imprisonment for a term which may extend to six months or fine which may extend five hundred thousand rupees or both",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "19",
    "text": "A person who gives false information about the commission of violence which that person knows or has reason to believe to be false, shall be liable to punishment of imprisonment for a term which may extend to three months or fine which may extend to one hundred thousand rupees but not less than fifty thousand rupees",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "20",
    "text": "A defendant who commits breach of an interim order, protection order, residence order or monetary order, or illegally interferes with GPS tracker, shall be punished with imprisonment for a term which may extend to one year or fine which may extend to two hundred thousand rupees but not less than fifty thousand rupees",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "498‑A",
    "text": "Whoever by deceitful or illegal means deprives any woman from inheriting any movable or immovable property … shall be punished with imprisonment … not less than 5 years and up to 10 years, or fine up to one million rupees or both.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "498‑B",
    "text": "Whoever coerces or in any manner compels a woman to enter into marriage … shall be punished with imprisonment up to 7 years and fine up to 500,000 rupees; for a female child or non‑Muslim woman punishment is 5–10 years and fine up to 1 million rupees.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "498‑C",
    "text": "Forcing, arranging or facilitating a woman’s marriage with the Holy Qur’an or similar custom … punishable with imprisonment 3–7 years and fine 500,000 rupees.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "354",
    "text": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty … shall be punished with imprisonment of either description for a term which may extend to two years, or fine, or both.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "354‑A",
    "text": "Includes indecent exposure, inducing sexual act by force or threat, or stripping a woman’s clothes—punishable by imprisonment (variable up to life) and fine.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "365‑B",
    "text": "Whoever kidnaps or abducts a woman with intent that she may be forced or seduced to illicit intercourse, or knowing it likely that she will be forced or seduced … shall be punished with imprisonment for life, and shall also be liable to fine.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "366‑A & 366‑B",
    "text": "Section 366‑A: Inducing a girl under 18 to go from lawful guardianship … punishable up to 10 years + fine. Section 366‑B: similar offense for importing a girl under 21.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "375 & 376",
    "text": "Section 375 defines rape; Section 376 prescribes punishment from 10 years to life imprisonment or death, plus fine.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "493‑A",
    "text": "Whoever has sexual intercourse with a woman deceiving her by dishonestly inducing her to believe that he would marry her … shall be punishable with imprisonment for life or up to 25 years and fine.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Penal Code",
    "reference": "496‑A",
    "text": "Enticing or detaining a woman with intent that she may have illicit intercourse … punishable with imprisonment up to 7 years and fine.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  }
]