[
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 1",
    "text": "(1) This Ordinance may be called the Muslim Family Laws Ordinance, 1961. (2) It extends to whole of Pakistan, and applies to all Muslim citizens of Pakistan, wherever they may be. (3) It shall come into force on such date as the Federal Government may, by notification in the official Gazette, appoint in this behalf.",
    "country": "Pakistan",
    "relevance_score": 0.92,
    "theme_tags": [
        "law",
        "family",
        "jurisdiction"
    ]
},
{
    "category": "Legal & Testimony Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 2",
    "text": "(a) “Arbitration Council” means a body consisting of the Chairman and a representative of each of the parties to a matter dealt with this Ordinance: Provided that where any party fails to nominate a representative within the prescribed time, the body formed without such representative shall be the Arbitration Council. (b) “Chairman” means the Chairman of the Union Council or a person appointed by the Federal Government in the Cantonment areas or by the Provincial Government in other areas or by an Officer authorised in that behalf by any such Government to discharge the functions of chairman under Ordinance: Provided that where the Chairman of the Union Council is a non-Muslim, or he himself wishes to make an application to the Arbitration Council, or is, owing to illness or any other reason, unable to discharge the functions of Chairman, the Council shall elect one of its Muslim members as Chairman for the purposes of this Ordinance. (c) “Prescribed” means prescribed by rules made under Sch. II. (d) “Union Council” means the Union Council or the Town or Union Committee constituted under the Basic Democracies Order, 1959 and having jurisdiction in the matter as prescribed. (e) “Ward” means a ward within a Union or Town as defined in the aforesaid Order.",
    "country": "Pakistan",
    "relevance_score": 0.96,
    "theme_tags": [
        "definitions",
        "procedure",
        "local-governance"
    ]
},
{
    "category": "Legal & Testimony Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 3",
    "text": "(1) The provisions of this Ordinance shall have effect notwithstanding any law, custom or usage, and the registration of Muslim marriages shall take place only in accordance with these provisions. (2) For the removal of doubt, it is hereby declared that the provisions of the Arbitration Act, 1940 (X of 1940), the Code of Civil Procedure 1908 (Act V of 1908), and any other law regulating the procedure of Courts shall not apply to any Arbitration Council.",
    "country": "Pakistan",
    "relevance_score": 0.95,
    "theme_tags": [
        "family law",
        "registration",
        "procedure"
    ]
},
{
    "category": "Family Rights & Property",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 4",
    "text": "In the event of death of any son or daughter of the propositus before the opening of succession, the children of such son or daughter, if any, living at the time the succession opens, shall per stirpes, receive a share equivalent to the share which such son or daughter, as the case may be, would have received if alive.",
    "country": "Pakistan",
    "relevance_score": 0.88,
    "theme_tags": [
        "inheritance",
        "family",
        "women-property-rights"
    ]
},
{
    "category": "Marriage & Family Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 5",
    "text": "(1) Every marriage solemnized under Muslim Law shall be registered in accordance with the provisions of this Ordinance. (2) For the purpose of registration of marriage under this Ordinance, the Union Council shall grant licenses to one or more persons, to be called Nikah Registrars, but in no case shall more than one Nikah Registrar be licensed for any one Ward. (3) Every marriage not solemnized by the Nikah Registrar shall, for the purpose of registration under this Ordinance be reported to him by the person who has solemnized such marriage. (4) Whoever contravenes the provisions of sub-section (3) shall be punishable with simple imprisonment for a term which may extend to three months, or with fine which may extend to one thousand rupees, or with both. (5) The form of nikahnama, the registers to be maintained by Nikah Registrars, the records to be preserved by Union Councils, the manner in which marriage shall be registered and copies of nikahnama shall be supplied to parties, and the fees to be charged thereof, shall be such as may be prescribed. (6) Any person may, on payment of the prescribed fee, if any, inspect at the office of the Union Council the record preserved under sub-section (5), or obtain a copy of any entry therein.",
    "country": "Pakistan",
    "relevance_score": 0.99,
    "theme_tags": [
        "marriage",
        "documentation",
        "women-rights"
    ]
},
{
    "category": "Marriage & Women's Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 6",
    "text": "(1) No man, during the subsistence of an existing marriage, shall except with the previous permission in writing of the Arbitration Council, contract another marriage, nor shall any such marriage contracted without such permission be registered under this Ordinance. (2) An application for permission under sub-section (1) shall be submitted to the Chairman in the prescribed manner together with the prescribed fee, and shall state reasons for the proposed marriage, and whether the consent of existing wife or wives has been obtained thereto. (3) On receipt of the application under Sub-section (3), Chairman shall ask the applicant and his existing wife or wives each to nominate a representative, and the Arbitration Council so constituted may, if satisfied that the proposed marriage is necessary and just, grant, subject to such condition if any, as may be deemed fit, the permission applied for. (4) In deciding the application the Arbitration Council shall record its reasons for the decision and any party may, in the prescribed manner, within the prescribed period, and on payment of the prescribed fee, prefer an application for revision, to the Collector concerned and his decision shall be final and shall not be called in question in any Court. (5) Any man who contracts another marriage without the permission of the Arbitration Council shall, (a) pay immediately the entire amount of the dower whether prompt or deferred, due to the existing wife or wives, which amount, if not so paid, shall be recoverable as arrears of land revenue; and (b) on conviction upon complaint be punishable with the simple imprisonment which may extend to one year, or with fine which may extend to five thousand rupees, or with both.",
    "country": "Pakistan",
    "relevance_score": 0.99,
    "theme_tags": [
        "polygamy",
        "women-protection",
        "dower",
        "family-law"
    ]
},
{
    "category": "Divorce & Women's Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 7",
    "text": "(1) Any man who wishes to divorce his wife shall, as soon as may be after the pronouncement of talaq in any form whatsoever, give the chairman a notice in writing of his having done so, and shall supply a copy thereof to the wife. (2) Whoever, contravenes the provisions of sub-section (1) shall be punishable with simple imprisonment for a term which may extend to one year, or with fine which may extend to five thousand rupees, or with both. (3) Save as provided in sub-section (5) talaq, unless revoked earlier, expressly or otherwise, shall not be effective until the expiration of ninety days from day on which notice under sub-section (1) is delivered to the Chairman. (4) Within thirty days of the receipt of notice under Sub-section (1), the Chairman shall constitute an Arbitration Council for the purpose of bringing about a reconciliation between the parties, and the Arbitration Council shall take all steps necessary to bring about such reconciliation. (5) If the wife be pregnant at the time talaq is pronounced, talaq shall not be effective until the period mentioned in Sub-section (3) or the pregnancy, whichever later, ends. (6) Nothing shall debar a wife whose marriage has been terminated by talaq effective under this section from remarrying the same husband, without an intervening marriage with a third person, unless such termination is for the third time so effective.",
    "country": "Pakistan",
    "relevance_score": 0.99,
    "theme_tags": [
        "divorce",
        "women",
        "reconciliation",
        "family-law"
    ]
},
{
    "category": "Divorce & Family Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 8",
    "text": "Where the right to divorce has been duly delegated to the wife and she wishes to exercise that right, or where any of the parties to a marriage wishes to dissolve the marriage otherwise than by talaq the provisions of section 7 shall, mutatis mutandis and so far as applicable, apply.",
    "country": "Pakistan",
    "relevance_score": 0.94,
    "theme_tags": [
        "wife-rights",
        "divorce-procedure",
        "family-law"
    ]
},
{
    "category": "Maintenance & Economic Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 9",
    "text": "(1) If any husband fails to maintain his wife adequately, or where there are more wives than one, fails to maintain them equitably, the wife, or all or any of the wives, may in addition to seeking any other legal remedy available apply to the Chairman who shall constitute an Arbitration Council to determine the matter, and the Arbitration Council may issue a certificate specifying the amount which shall be paid as maintenance by the husband. (2) A husband or wife may, in the prescribed manner, within the prescribed period, and on payment of the prescribed fee, prefer an application for revision of the certificate, to the Collector concerned and his decision shall be final and shall not be called in question in any Court. (3) Any amount payable under Sub-section (1) or, (2) if, not paid in the due time, shall be recoverable as arrears of land revenue.",
    "country": "Pakistan",
    "relevance_score": 0.99,
    "theme_tags": [
        "maintenance",
        "women-economic-rights",
        "enforcement"
    ]
},
{
    "category": "Dower & Financial Rights",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 10",
    "text": "Where no details about the mode of payment of dower are specified in the nikahnama or the marriage contract, the entire amount of the dower shall be presumed to be payable on demand.",
    "country": "Pakistan",
    "relevance_score": 0.97,
    "theme_tags": [
        "mahr",
        "women-economics",
        "marriage-contract"
    ]
},
{
    "category": "Implementation & Enforcement",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961",
    "reference": "Section 11",
    "text": "(1) The Government may make rules to carry into effect the purposes of this Ordinance. (2) In making rules under this section, such Government, may provide that a breach of any of the rules shall be punishable with simple imprisonment which may extend to one month, or with fine which may extent to two hundred rupees, or with both. (3) Rules made under this section shall be published in the official Gazette and shall thereupon have effect as if enacted in this Ordinance.",
    "country": "Pakistan",
    "relevance_score": 0.85,
    "theme_tags": [
        "administration",
        "enforcement",
        "policy"
    ]
},
 {
    "category": "Amendments & Notes",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961 (as amended)",
    "reference": "Section 12 (omitted)",
    "text": "Omitted by Ord. 27 of 1981.",
    "country": "Pakistan",
    "relevance_score": 0.60,
    "theme_tags": [
        "child-marriage",
        "amendment"
    ]
},
{
    "category": "Amendments & Notes",
    "source_type": "Pakistani Laws",
    "source_name": "Muslim Family Laws Ordinance, 1961 (as amended)",
    "reference": "Section 13 (omitted)",
    "text": "Omitted by Ord. 27 of 1981.",
    "country": "Pakistan",
    "relevance_score": 0.60,
    "theme_tags": [
        "dissolution",
        "amendment"
    ]
}
]