[
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-001",
    "text": "(1) This Act may be called the Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019. (2) It shall extend to the whole of the Province of the Khyber Pakhtunkhwa. (3) It shall come into force at once.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-002",
    "text": "In this Act, unless the context otherwise requires, the following expressions shall have the meanings respectively assigned to them: (a) 'complainant' means a woman who files a complaint or for whom proceedings are initiated in respect of the title or possession of her property; (b) 'Government' means the Government of the Khyber Pakhtunkhwa; (c) 'Ombudsperson' means the Ombudsperson appointed under section 7 of the Protection against Harassment of Women at the Workplace Act, 2010 (IV of 2010); (d) 'prescribed' means prescribed by rules; (e) 'property' includes any moveable and immoveable property; and (f) 'rules' means rules made under this Act.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-003",
    "text": "In addition to the powers, functions, and authority under this Act and rules made thereunder, the Ombudsperson, for the purpose of this Act, shall have the same powers, functions, and authority as are vested in the Ombudsperson for the Protection against Harassment of Women at the Workplace Act, 2010 (IV of 2010).",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-004",
    "text": "(1) Any woman deprived of ownership or possession of her property by any means may file a complaint to the Ombudsperson if no proceedings in a court of law are pending regarding that property. The Ombudsperson may also act on its own motion or on a complaint filed by any person or NGO. (2) The Ombudsperson shall make a preliminary assessment and may refer the matter to the concerned Deputy Commissioner for summary enquiry and report within fifteen days. (3) If the matter does not require detailed probe or evidence, the Ombudsperson may pass orders under section 5. (4) The Ombudsperson may conduct further enquiry and call for records as needed. (5) After reviewing the report and findings, the Ombudsperson shall hear both parties and pass orders under section 5, preferably within sixty days of receiving the complaint.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-005",
    "text": "(1) On conclusion of proceedings under section 4, if the Ombudsperson finds that the complainant has been illegally deprived of ownership or possession of her property, he shall direct the Deputy Commissioner or any relevant authority to restore or confer possession or title to the complainant. (2) The Ombudsperson may direct the officer-in-charge of a police station to assist in implementing the orders. (3) The concerned Deputy Commissioner shall submit a compliance report within seven days to the Ombudsperson.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-006",
    "text": "(1) If the Ombudsperson concludes that a matter requires detailed investigation, evidence, or adjudication, they shall formulate a reference along with reports and submit it to the Civil Court within sixty days of the complaint. (2) The Civil Court shall entertain such reference as a civil suit and proceed under the Code of Civil Procedure, 1908.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-007",
    "text": "(1) Where proceedings in a Court are pending regarding ownership or possession of a woman’s property, she or an NGO may file a complaint to the Ombudsperson. (2) The Ombudsperson may refer the matter to the concerned Deputy Commissioner for a summary enquiry and report within fifteen days. (3) If no detailed probe is needed, the Ombudsperson may file a report in the Court recommending suspension or termination of proceedings and permission to proceed under this Act. (4) Before filing such report, the Ombudsperson shall hear both parties and pass an order within thirty days. (5) If the Ombudsperson decides not to file a report, the complainant shall be advised to continue proceedings in Court. (6) The Ombudsperson may conduct further enquiry or call for record as necessary.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-008",
    "text": "Any person aggrieved by an order of the Ombudsperson may, within forty-five days of the order, prefer an appeal to the Peshawar High Court.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-009",
    "text": "On conclusion of proceedings under section 5, the Ombudsperson may direct the person depriving the complainant of her property to pay the amount equivalent to the market rent for the duration she was deprived of its use.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-010",
    "text": "The Ombudsperson may direct any executive functionary, including the concerned Deputy Commissioner, to execute the orders in letter and spirit.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-011",
    "text": "For carrying out the purposes of this Act, the Government shall appoint such officers as may be required, on such terms and conditions as prescribed.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-012",
    "text": "No Court or other authority shall have jurisdiction to question the validity of any action taken or order made under this Act, or to grant any injunction or stay in relation to proceedings before or actions taken by the Ombudsperson.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Khyber Pakhtunkhwa Enforcement of Women's Property Rights Act, 2019",
    "reference": "WR-013",
    "text": "The Government may, by notification in the official Gazette, make rules to carry out the purposes of this Act.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  }
]