[
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-001",
    "text": "This Act may be called the Protection Against Harassment of Women at the Workplace Act, 2010. It extends to the whole of Pakistan and shall come into force at once.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-002",
    "text": "The Act defines key terms including 'accused' as an employee or employer against whom a complaint is made; 'Complainant' as a person aggrieved by harassment; 'Employer' as any person or entity responsible for management; and 'harassment' as any unwelcome sexual advance, request for sexual favors, or conduct of a sexual nature creating a hostile work environment or made a condition of employment.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-003",
    "text": "\"harassment\" means any unwelcome sexual advance, request for sexual favors or other verbal or written communication or physical conduct of a sexual nature or sexually demeaning attitudes, causing interference with work performance or creating an intimidating, hostile or offensive work environment, or the attempt to punish the complainant for refusal to comply to such a request or is made a condition for employment.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-004",
    "text": "Each organization shall constitute an Inquiry Committee within thirty days of the enactment of this Act to enquire into complaints under this Act. The Committee shall consist of three members of whom at least one member shall be a woman. One member shall be from senior management and one shall be a senior representative of the employees or a senior employee where there is no CBA.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-005",
    "text": "The Inquiry Committee, within three days of receipt of a written complaint, shall communicate to the accused the charges and statement of allegations leveled against him; require the accused within seven days to submit a written defense; and enquire into the charge by examining oral or documentary evidence. The Committee shall give its findings in writing and recommend minor or major penalties to the Competent Authority.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-006",
    "text": "The Inquiry Committee shall have powers to summon and enforce attendance of any person, require discovery and production of any document, receive evidence on affidavits, and record evidence. It may recommend appropriate penalties or refer false allegations made with mala fide intentions to the Ombudsman for action.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-007",
    "text": "Any party aggrieved by a decision of the Competent Authority on whom minor or major penalty is imposed may, within thirty days of written communication of decision, prefer an appeal to an Ombudsman established under section 7. The Ombudsman or the Appellate Authority may confirm, set aside, vary or modify the decision within thirty days. Until an Ombudsman is appointed, the District Court shall have jurisdiction to hear such appeals, which shall later transfer to the Ombudsman upon appointment.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-008",
    "text": "The respective Governments shall appoint an Ombudsman at the Federal and Provincial levels. A person qualified to be appointed as a judge of High Court or who has been a judge of High Court shall be eligible. The Ombudsman may recruit staff as required and shall be financed by the respective Governments.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-009",
    "text": "An employee may prefer a complaint either to the Ombudsman or the Inquiry Committee. The Ombudsman shall issue a show cause notice to the accused within three days of receiving the complaint, require a written defense within five days, and may proceed ex parte if no response is received. The Ombudsman shall conduct an inquiry, may require any information or documents relevant to the case, and shall record and communicate the decision to both parties and the management.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-010",
    "text": "Any person aggrieved by a decision of the Ombudsman under section 8(5) may, within thirty days of the decision, make a representation to the President or Governor, as the case may be, who may pass such order thereon as deemed fit.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-011",
    "text": "The Ombudsman shall have the same powers as are vested in a Civil Court under the Code of Civil Procedure, 1908, including summoning and enforcing attendance, compelling production of evidence, receiving evidence on affidavits, issuing commissions for witness examination, entering premises for inspection, and punishing for contempt. The Ombudsman may impose any of the penalties specified in section 4(4).",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-012",
    "text": "It is the responsibility of the employer to ensure implementation of this Act, including incorporating the Code of Conduct for protection against harassment at the workplace as part of management policy, forming an Inquiry Committee under section 3, and designating a competent authority under section 4. Copies of the Code must be displayed in English and a local language within six months. Non-compliance may result in fines from twenty-five thousand to one hundred thousand rupees.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-013",
    "text": "The provisions of this Act shall be in addition to and not in derogation of any other law for the time being in force.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  },
  {
    "category": "Legal & Testimony Rights",
    "source_type": "Legislation",
    "source_name": "Protection Against Harassment of Women at the Workplace Act, 2010",
    "reference": "WR-014",
    "text": "The Federal Government may make rules to carry out the purposes of this Act.",
    "country": "Global (Islamic)",
    "relevance_score": 0.97,
    "theme_tags": [
      "law",
      "testimony",
      "justice"
    ]
  }
]